{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "data = pd.read_csv(\"C:/Users/Daniel/Documents/Masterarbeit/mup_valid_articles.csv\", encoding=\"utf-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "outputs": [],
   "source": [
    "# load the functionalities\n",
    "from entitynetwork.enititynetwork_pipeline.process_article import *\n",
    "from entitynetwork.database_creation.fill_database import *\n",
    "from entitynetwork.relation_extraction.relation_extraction import *\n",
    "#from entitynetwork.validation_tool.relation_validation import *"
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%%\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "outputs": [],
   "source": [
    "# Establishe DB Connection\n",
    "g = connect_database()\n"
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%%\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "outputs": [],
   "source": [
    "# Tag selection\n",
    "\n",
    "selected_tag = [\"B-PERSON\", \"I-PERSON\", \"B-FAC\", \"I-FAC\", \"B-ORG\", \"I-ORG\", \"B-GPE\", \"I-GPE\",\n",
    "                \"B-LOC\", \"I-LOC\", \"B-WORK_OF_ART\", \"I-WORK_OF_ART\", \"B-LAW\", \"I-LAW\"]"
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%%\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Current Article0\n",
      "Current Article1\n",
      "Current Article2\n",
      "Current Article3\n",
      "Current Article4\n",
      "Current Article5\n",
      "Current Article6\n",
      "Current Article7\n",
      "Current Article8\n",
      "Current Article9\n",
      "Current Article10\n",
      "Current Article11\n",
      "Current Article12\n",
      "Current Article13\n",
      "Current Article14\n",
      "Current Article15\n",
      "Current Article16\n",
      "Current Article17\n",
      "Current Article18\n",
      "Current Article19\n",
      "Current Article20\n",
      "Current Article21\n",
      "Current Article22\n",
      "Current Article23\n",
      "Current Article24\n",
      "Current Article25\n",
      "Current Article26\n",
      "Current Article27\n",
      "Current Article28\n",
      "Current Article29\n",
      "Current Article30\n",
      "Current Article31\n",
      "Current Article32\n",
      "Current Article33\n",
      "Current Article34\n",
      "Current Article35\n",
      "Current Article36\n",
      "Current Article37\n",
      "Current Article38\n",
      "Current Article39\n",
      "Current Article40\n",
      "Current Article41\n",
      "Current Article42\n",
      "Current Article43\n",
      "Current Article44\n",
      "Current Article45\n",
      "Current Article46\n",
      "Current Article47\n",
      "Current Article48\n",
      "Current Article49\n",
      "Current Article50\n",
      "Current Article51\n",
      "Current Article52\n",
      "Current Article53\n",
      "Current Article54\n",
      "Current Article55\n",
      "Current Article56\n",
      "Current Article57\n",
      "Current Article58\n",
      "Current Article59\n",
      "Current Article60\n",
      "Current Article61\n",
      "Current Article62\n",
      "Current Article63\n",
      "Current Article64\n",
      "Current Article65\n",
      "Current Article66\n",
      "Current Article67\n",
      "Current Article68\n",
      "Current Article69\n",
      "Current Article70\n",
      "Current Article71\n",
      "Current Article72\n",
      "Current Article73\n",
      "Current Article74\n",
      "Current Article75\n",
      "Current Article76\n",
      "Current Article77\n",
      "Current Article78\n",
      "Current Article79\n",
      "Current Article80\n",
      "Current Article81\n",
      "Current Article82\n",
      "Current Article83\n",
      "Current Article84\n",
      "Current Article85\n",
      "Current Article86\n",
      "Current Article87\n",
      "Current Article88\n",
      "Current Article89\n",
      "Current Article90\n",
      "Current Article91\n",
      "Current Article92\n",
      "Current Article93\n",
      "Current Article94\n",
      "Current Article95\n",
      "Current Article96\n",
      "Current Article97\n",
      "Current Article98\n",
      "Current Article99\n",
      "Current Article100\n",
      "Current Article101\n",
      "Current Article102\n",
      "Current Article103\n",
      "Current Article104\n",
      "Current Article105\n",
      "Current Article106\n",
      "Current Article107\n",
      "Current Article108\n",
      "Current Article109\n",
      "Current Article110\n",
      "Current Article111\n",
      "Current Article112\n",
      "Current Article113\n",
      "Current Article114\n",
      "Current Article115\n",
      "Current Article116\n",
      "Current Article117\n",
      "Current Article118\n",
      "Current Article119\n",
      "Current Article120\n",
      "Current Article121\n",
      "Current Article122\n",
      "Current Article123\n",
      "Current Article124\n",
      "Current Article125\n",
      "Current Article126\n",
      "Current Article127\n",
      "Current Article128\n",
      "Current Article129\n",
      "Current Article130\n",
      "Current Article131\n",
      "Current Article132\n",
      "Current Article133\n",
      "Current Article134\n",
      "Current Article135\n",
      "Current Article136\n",
      "Current Article137\n",
      "Current Article138\n",
      "Current Article139\n",
      "Current Article140\n",
      "Current Article141\n",
      "Current Article142\n",
      "Current Article143\n",
      "Current Article144\n",
      "Current Article145\n",
      "Current Article146\n",
      "Current Article147\n",
      "Current Article148\n",
      "Current Article149\n",
      "Current Article150\n",
      "Current Article151\n",
      "Current Article152\n",
      "Current Article153\n",
      "Current Article154\n",
      "Current Article155\n",
      "Current Article156\n",
      "Current Article157\n",
      "Current Article158\n",
      "Current Article159\n",
      "Current Article160\n",
      "Current Article161\n",
      "Current Article162\n",
      "Current Article163\n",
      "Current Article164\n",
      "Current Article165\n",
      "Current Article166\n",
      "Current Article167\n",
      "Current Article168\n",
      "Current Article169\n",
      "Current Article170\n",
      "Current Article171\n",
      "Current Article172\n",
      "Current Article173\n",
      "Current Article174\n",
      "Current Article175\n",
      "Current Article176\n",
      "Current Article177\n",
      "Current Article178\n",
      "Current Article179\n",
      "Current Article180\n",
      "Current Article181\n",
      "Current Article182\n",
      "Current Article183\n",
      "Current Article184\n",
      "Current Article185\n",
      "Current Article186\n",
      "Current Article187\n",
      "Current Article188\n",
      "Current Article189\n",
      "Current Article190\n",
      "Current Article191\n",
      "Current Article192\n",
      "Current Article193\n",
      "Current Article194\n",
      "Current Article195\n",
      "Current Article196\n",
      "Current Article197\n",
      "Current Article198\n",
      "Current Article199\n",
      "Current Article200\n",
      "Current Article201\n",
      "Current Article202\n",
      "Current Article203\n",
      "Current Article204\n",
      "Current Article205\n",
      "Current Article206\n",
      "Current Article207\n",
      "Current Article208\n",
      "Current Article209\n",
      "Current Article210\n",
      "Current Article211\n",
      "Current Article212\n",
      "Current Article213\n",
      "Current Article214\n",
      "Current Article215\n",
      "Current Article216\n",
      "Current Article217\n",
      "Current Article218\n",
      "Current Article219\n",
      "Current Article220\n",
      "Current Article221\n",
      "Current Article222\n",
      "Current Article223\n",
      "Current Article224\n",
      "Current Article225\n",
      "Current Article226\n",
      "Current Article227\n",
      "Current Article228\n",
      "Current Article229\n",
      "Current Article230\n",
      "Current Article231\n",
      "Current Article232\n",
      "Current Article233\n",
      "Current Article234\n",
      "Current Article235\n",
      "Current Article236\n",
      "Current Article237\n",
      "Current Article238\n",
      "Current Article239\n",
      "Current Article240\n",
      "Current Article241\n",
      "Current Article242\n",
      "Current Article243\n",
      "Current Article244\n",
      "Current Article245\n",
      "Current Article246\n",
      "Current Article247\n",
      "Current Article248\n",
      "Current Article249\n",
      "Current Article250\n",
      "Current Article251\n",
      "Current Article252\n",
      "Current Article253\n",
      "Current Article254\n",
      "Current Article255\n",
      "Current Article256\n",
      "Current Article257\n",
      "Current Article258\n",
      "Current Article259\n",
      "Current Article260\n",
      "Current Article261\n",
      "Current Article262\n",
      "Current Article263\n",
      "Current Article264\n",
      "Current Article265\n",
      "Current Article266\n",
      "Current Article267\n",
      "Current Article268\n",
      "Current Article269\n",
      "Current Article270\n",
      "Current Article271\n",
      "Current Article272\n",
      "Current Article273\n",
      "Current Article274\n",
      "Current Article275\n",
      "Current Article276\n",
      "Current Article277\n",
      "Current Article278\n",
      "Current Article279\n",
      "Current Article280\n",
      "Current Article281\n",
      "Current Article282\n",
      "Current Article283\n",
      "Current Article284\n",
      "Current Article285\n",
      "Current Article286\n",
      "Current Article287\n",
      "Current Article288\n",
      "Current Article289\n",
      "Current Article290\n",
      "Current Article291\n",
      "Current Article292\n",
      "Current Article293\n",
      "Current Article294\n",
      "Current Article295\n",
      "Current Article296\n",
      "Current Article297\n",
      "Current Article298\n",
      "Current Article299\n",
      "Current Article300\n",
      "Current Article301\n",
      "Current Article302\n",
      "Current Article303\n",
      "Current Article304\n",
      "Current Article305\n",
      "Current Article306\n",
      "Current Article307\n",
      "Current Article308\n",
      "Current Article309\n",
      "Current Article310\n",
      "Current Article311\n",
      "Current Article312\n",
      "Current Article313\n",
      "Current Article314\n",
      "Current Article315\n",
      "Current Article316\n",
      "Current Article317\n",
      "Current Article318\n",
      "Current Article319\n",
      "Current Article320\n",
      "Current Article321\n",
      "Current Article322\n",
      "Current Article323\n",
      "Current Article324\n",
      "Current Article325\n",
      "Current Article326\n",
      "Current Article327\n",
      "Current Article328\n",
      "Current Article329\n",
      "Current Article330\n",
      "Current Article331\n",
      "Current Article332\n",
      "Current Article333\n",
      "Current Article334\n",
      "Current Article335\n",
      "Current Article336\n",
      "Current Article337\n",
      "Current Article338\n",
      "Current Article339\n",
      "Current Article340\n",
      "Current Article341\n",
      "Current Article342\n",
      "Current Article343\n",
      "Current Article344\n",
      "Current Article345\n",
      "Current Article346\n",
      "Current Article347\n",
      "Current Article348\n",
      "Current Article349\n",
      "Current Article350\n",
      "Current Article351\n",
      "Current Article352\n",
      "Current Article353\n",
      "Current Article354\n",
      "Current Article355\n",
      "Current Article356\n",
      "Current Article357\n",
      "Current Article358\n",
      "Current Article359\n",
      "Current Article360\n",
      "Current Article361\n",
      "Current Article362\n",
      "Current Article363\n",
      "Current Article364\n",
      "Current Article365\n",
      "Current Article366\n",
      "Current Article367\n",
      "Current Article368\n",
      "Current Article369\n",
      "Current Article370\n",
      "Current Article371\n",
      "Current Article372\n",
      "Current Article373\n",
      "Current Article374\n",
      "Current Article375\n",
      "Current Article376\n",
      "Current Article377\n",
      "Current Article378\n",
      "Current Article379\n",
      "Current Article380\n",
      "Current Article381\n",
      "Current Article382\n",
      "Current Article383\n",
      "Current Article384\n",
      "Current Article385\n",
      "Current Article386\n",
      "Current Article387\n",
      "Current Article388\n",
      "Current Article389\n",
      "Current Article390\n",
      "Current Article391\n",
      "Current Article392\n",
      "Current Article393\n",
      "Current Article394\n",
      "Current Article395\n",
      "Current Article396\n",
      "Current Article397\n",
      "Current Article398\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "[nltk_data] Downloading package punkt to\n",
      "[nltk_data]     C:\\Users\\Daniel\\AppData\\Roaming\\nltk_data...\n",
      "[nltk_data]   Package punkt is already up-to-date!\n",
      "[nltk_data] Downloading package stopwords to\n",
      "[nltk_data]     C:\\Users\\Daniel\\AppData\\Roaming\\nltk_data...\n",
      "[nltk_data]   Package stopwords is already up-to-date!\n",
      "[nltk_data] Downloading package perluniprops to\n",
      "[nltk_data]     C:\\Users\\Daniel\\AppData\\Roaming\\nltk_data...\n",
      "[nltk_data]   Package perluniprops is already up-to-date!\n",
      "[nltk_data] Downloading package nonbreaking_prefixes to\n",
      "[nltk_data]     C:\\Users\\Daniel\\AppData\\Roaming\\nltk_data...\n",
      "[nltk_data]   Package nonbreaking_prefixes is already up-to-date!\n",
      "2020-07-06 02:39:05.722 INFO in 'deeppavlov.core.data.simple_vocab'['simple_vocab'] at line 115: [loading vocabulary from C:\\Users\\Daniel\\.deeppavlov\\models\\ner_ontonotes_bert_mult\\tag.dict]\n",
      "2020-07-06 02:39:45.966 INFO in 'deeppavlov.core.models.tf_model'['tf_model'] at line 51: [loading model from C:\\Users\\Daniel\\.deeppavlov\\models\\ner_ontonotes_bert_mult\\model]\n",
      "C:\\Users\\Daniel\\Documents\\Masterarbeit\\CSS_Termpaper\\EntityNetwork\\entitynetwork\\database_creation\\fill_database.py:109: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame\n",
      "\n",
      "See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  syns[\"n.synonyms\"][i] = get_synonyms(syns[\"n.synonyms\"][i])\n",
      "C:\\Users\\Daniel\\Documents\\Masterarbeit\\CSS_Termpaper\\EntityNetwork\\entitynetwork\\named_entity_extraction\\entity_extraction.py:58: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame\n",
      "\n",
      "See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  article.entity_dataset.df[\"count\"][j] = article.entity_dataset.df[\"count\"][j] + duplicates[\"count\"][i]\n"
     ]
    }
   ],
   "source": [
    "# Start the validation and store the data\n",
    "for i in range(len(data)):\n",
    "    print(\"Current Article\" + str(i))\n",
    "    article = Article(data[\"text\"][i], data[\"author_extracted\"][i], data[\"date\"][i], data[\"source\"][i], data[\"id\"][i],\n",
    "               download_model=False, selected_tags=selected_tag, n_shift=1,graph=g)\n",
    "    article.process_articles()"
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%%\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "350\n",
      "351\n",
      "352\n",
      "354\n",
      "355\n",
      "357\n",
      "358\n",
      "359\n",
      "360\n",
      "361\n",
      "362\n",
      "363\n",
      "364\n",
      "365\n",
      "366\n",
      "367\n",
      "370\n",
      "371\n",
      "372\n",
      "373\n",
      "375\n",
      "377\n",
      "379\n",
      "380\n",
      "382\n",
      "383\n",
      "384\n",
      "385\n",
      "386\n",
      "391\n",
      "392\n",
      "393\n",
      "394\n",
      "397\n",
      "399\n",
      "402\n",
      "403\n",
      "404\n",
      "405\n",
      "406\n",
      "407\n",
      "408\n",
      "409\n",
      "410\n",
      "411\n",
      "412\n",
      "413\n",
      "414\n",
      "415\n",
      "418\n",
      "419\n",
      "420\n",
      "421\n",
      "422\n",
      "423\n",
      "425\n",
      "426\n",
      "427\n",
      "428\n",
      "429\n",
      "430\n",
      "431\n",
      "432\n",
      "433\n",
      "434\n",
      "435\n",
      "436\n",
      "437\n",
      "438\n",
      "439\n",
      "440\n",
      "442\n",
      "443\n",
      "444\n",
      "445\n",
      "446\n",
      "447\n",
      "448\n",
      "449\n",
      "453\n",
      "454\n",
      "455\n",
      "459\n",
      "460\n",
      "461\n",
      "462\n",
      "464\n",
      "465\n",
      "467\n",
      "468\n",
      "470\n",
      "471\n",
      "474\n",
      "477\n",
      "478\n",
      "479\n",
      "481\n",
      "482\n",
      "483\n",
      "485\n",
      "486\n",
      "491\n",
      "503\n",
      "504\n",
      "505\n",
      "508\n",
      "509\n",
      "510\n",
      "511\n",
      "512\n",
      "513\n",
      "515\n",
      "516\n",
      "517\n",
      "518\n",
      "519\n",
      "520\n",
      "521\n",
      "523\n",
      "525\n",
      "526\n",
      "530\n",
      "531\n",
      "534\n",
      "536\n",
      "537\n",
      "538\n",
      "540\n",
      "541\n",
      "542\n",
      "544\n",
      "545\n",
      "547\n",
      "548\n",
      "551\n",
      "552\n",
      "553\n",
      "554\n",
      "555\n",
      "556\n",
      "557\n",
      "558\n",
      "559\n",
      "560\n",
      "562\n",
      "564\n",
      "565\n",
      "566\n",
      "567\n",
      "569\n",
      "571\n",
      "572\n",
      "573\n",
      "574\n",
      "575\n",
      "576\n",
      "577\n",
      "578\n",
      "579\n",
      "580\n",
      "581\n",
      "582\n",
      "584\n",
      "585\n",
      "586\n",
      "587\n",
      "588\n",
      "589\n",
      "591\n",
      "592\n",
      "593\n",
      "594\n",
      "595\n",
      "596\n",
      "597\n",
      "598\n",
      "600\n",
      "601\n",
      "604\n",
      "605\n",
      "606\n",
      "607\n",
      "608\n",
      "609\n",
      "610\n",
      "611\n",
      "612\n",
      "613\n",
      "614\n",
      "615\n",
      "616\n",
      "617\n",
      "618\n",
      "619\n",
      "620\n",
      "621\n",
      "622\n",
      "623\n",
      "624\n",
      "625\n",
      "627\n",
      "628\n",
      "629\n",
      "630\n",
      "632\n",
      "633\n",
      "634\n",
      "635\n",
      "636\n",
      "637\n",
      "638\n",
      "640\n",
      "641\n",
      "642\n",
      "643\n",
      "644\n",
      "645\n",
      "646\n",
      "647\n",
      "648\n",
      "649\n",
      "650\n",
      "651\n",
      "652\n",
      "653\n",
      "654\n",
      "655\n",
      "656\n",
      "657\n",
      "660\n",
      "661\n",
      "662\n",
      "663\n",
      "664\n",
      "666\n",
      "667\n",
      "668\n",
      "669\n",
      "671\n",
      "672\n",
      "674\n",
      "675\n",
      "678\n",
      "679\n",
      "680\n",
      "681\n",
      "682\n",
      "683\n",
      "684\n",
      "685\n",
      "686\n",
      "687\n",
      "689\n",
      "691\n",
      "693\n",
      "695\n",
      "697\n",
      "700\n",
      "703\n",
      "705\n",
      "707\n",
      "708\n",
      "709\n",
      "710\n",
      "711\n",
      "712\n",
      "714\n",
      "715\n",
      "716\n",
      "717\n",
      "719\n",
      "720\n",
      "724\n",
      "725\n",
      "726\n",
      "727\n",
      "728\n",
      "729\n",
      "730\n",
      "731\n",
      "732\n",
      "733\n",
      "734\n",
      "735\n",
      "736\n",
      "738\n",
      "740\n",
      "748\n",
      "749\n",
      "750\n",
      "751\n",
      "752\n",
      "753\n",
      "754\n",
      "756\n",
      "758\n",
      "760\n",
      "762\n",
      "766\n",
      "767\n",
      "768\n",
      "769\n",
      "771\n",
      "772\n",
      "773\n",
      "774\n",
      "775\n",
      "776\n",
      "777\n",
      "779\n",
      "781\n",
      "782\n",
      "783\n",
      "784\n",
      "785\n",
      "786\n",
      "787\n",
      "788\n",
      "789\n",
      "790\n",
      "796\n",
      "797\n",
      "798\n",
      "799\n",
      "800\n",
      "801\n",
      "803\n",
      "804\n",
      "806\n",
      "807\n",
      "808\n",
      "809\n",
      "810\n",
      "812\n",
      "813\n",
      "815\n",
      "816\n",
      "818\n",
      "819\n",
      "821\n",
      "822\n",
      "824\n",
      "825\n",
      "826\n",
      "827\n",
      "829\n",
      "832\n",
      "833\n",
      "835\n",
      "837\n",
      "838\n",
      "840\n",
      "841\n",
      "842\n",
      "843\n",
      "844\n",
      "845\n",
      "846\n",
      "848\n",
      "850\n",
      "851\n",
      "852\n",
      "853\n",
      "854\n",
      "855\n",
      "856\n",
      "858\n",
      "859\n"
     ]
    }
   ],
   "source": [
    "cy_1 = \"CALL gds.alpha.degree.stream({nodeQuery: 'MATCH (a:Article) WHERE a.id = 1 WITH a.id as ids \"\n",
    "cy_2 = \"MATCH (e:Entity)-[r:OCCURS_WITH]-() WHERE r.article IN ids RETURN id(e) AS id',relationshipQuery: \"\n",
    "cy_3 = \"'MATCH (a:Article) WHERE a.id = 1 WITH a.id as ids MATCH (e:Entity)-[r:OCCURS_WITH]-(b:Entity) \"\n",
    "cy_4 = \"WHERE r.article IN ids RETURN id(e) AS source, id(b) AS target'}) YIELD nodeId, score WITH \"\n",
    "cy_5 = \"gds.util.asNode(nodeId).name AS user, score MATCH (e:Entity)-[r:OCCURS_IN]->(a:Article) WHERE e.name = user \"\n",
    "cy_6 = \"AND a.id = 1 AND score > 0 SET r.degree = toInteger(score)\"\n",
    "old_id = \"1\"\n",
    "for i in range(len(data)):\n",
    "    cy_1 = cy_1.replace(old_id, str(data[\"id\"][i]))\n",
    "    cy_3 = cy_3.replace(old_id, str(data[\"id\"][i]))\n",
    "    cy_6 = cy_6.replace(old_id, str(data[\"id\"][i]))\n",
    "    old_id = str(data[\"id\"][i])\n",
    "    if g.evaluate(\"MATCH p=()-[r:OCCURS_WITH]->() WHERE r.article = $id RETURN count(p)\", parameters={\"id\": int(data[\"id\"][i])})>0:\n",
    "        print(old_id)\n",
    "        g.run(cy_1+cy_2+cy_3+cy_4+cy_5+cy_6)"
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%%\n"
    }
   }
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "350\n",
      "351\n",
      "352\n",
      "354\n",
      "355\n",
      "357\n",
      "358\n",
      "359\n",
      "360\n",
      "361\n",
      "362\n",
      "363\n",
      "364\n",
      "365\n",
      "366\n",
      "367\n",
      "370\n",
      "371\n",
      "372\n",
      "373\n",
      "375\n",
      "377\n",
      "379\n",
      "380\n",
      "382\n",
      "383\n",
      "384\n",
      "385\n",
      "386\n",
      "391\n",
      "392\n",
      "393\n",
      "394\n",
      "397\n",
      "399\n",
      "402\n",
      "403\n",
      "404\n",
      "405\n",
      "406\n",
      "407\n",
      "408\n",
      "409\n",
      "410\n",
      "411\n",
      "412\n",
      "413\n",
      "414\n",
      "415\n",
      "418\n",
      "419\n",
      "420\n",
      "421\n",
      "422\n",
      "423\n",
      "425\n",
      "426\n",
      "427\n",
      "428\n",
      "429\n",
      "430\n",
      "431\n",
      "432\n",
      "433\n",
      "434\n",
      "435\n",
      "436\n",
      "437\n",
      "438\n",
      "439\n",
      "440\n",
      "442\n",
      "443\n",
      "444\n",
      "445\n",
      "446\n",
      "447\n",
      "448\n",
      "449\n",
      "453\n",
      "454\n",
      "455\n",
      "459\n",
      "460\n",
      "461\n",
      "462\n",
      "464\n",
      "465\n",
      "467\n",
      "468\n",
      "470\n",
      "471\n",
      "474\n",
      "477\n",
      "478\n",
      "479\n",
      "481\n",
      "482\n",
      "483\n",
      "485\n",
      "486\n",
      "491\n",
      "503\n",
      "504\n",
      "505\n",
      "508\n",
      "509\n",
      "510\n",
      "511\n",
      "512\n",
      "513\n",
      "515\n",
      "516\n",
      "517\n",
      "518\n",
      "519\n",
      "520\n",
      "521\n",
      "523\n",
      "525\n",
      "526\n",
      "530\n",
      "531\n",
      "534\n",
      "536\n",
      "537\n",
      "538\n",
      "540\n",
      "541\n",
      "542\n",
      "544\n",
      "545\n",
      "547\n",
      "548\n",
      "551\n",
      "552\n",
      "553\n",
      "554\n",
      "555\n",
      "556\n",
      "557\n",
      "558\n",
      "559\n",
      "560\n",
      "562\n",
      "564\n",
      "565\n",
      "566\n",
      "567\n",
      "569\n",
      "571\n",
      "572\n",
      "573\n",
      "574\n",
      "575\n",
      "576\n",
      "577\n",
      "578\n",
      "579\n",
      "580\n",
      "581\n",
      "582\n",
      "584\n",
      "585\n",
      "586\n",
      "587\n",
      "588\n",
      "589\n",
      "591\n",
      "592\n",
      "593\n",
      "594\n",
      "595\n",
      "596\n",
      "597\n",
      "598\n",
      "600\n",
      "601\n",
      "604\n",
      "605\n",
      "606\n",
      "607\n",
      "608\n",
      "609\n",
      "610\n",
      "611\n",
      "612\n",
      "613\n",
      "614\n",
      "615\n",
      "616\n",
      "617\n",
      "618\n",
      "619\n",
      "620\n",
      "621\n",
      "622\n",
      "623\n",
      "624\n",
      "625\n",
      "627\n",
      "628\n",
      "629\n",
      "630\n",
      "632\n",
      "633\n",
      "634\n",
      "635\n",
      "636\n",
      "637\n",
      "638\n",
      "640\n",
      "641\n",
      "642\n",
      "643\n",
      "644\n",
      "645\n",
      "646\n",
      "647\n",
      "648\n",
      "649\n",
      "650\n",
      "651\n",
      "652\n",
      "653\n",
      "654\n",
      "655\n",
      "656\n",
      "657\n",
      "660\n",
      "661\n",
      "662\n",
      "663\n",
      "664\n",
      "666\n",
      "667\n",
      "668\n",
      "669\n",
      "671\n",
      "672\n",
      "674\n",
      "675\n",
      "678\n",
      "679\n",
      "680\n",
      "681\n",
      "682\n",
      "683\n",
      "684\n",
      "685\n",
      "686\n",
      "687\n",
      "689\n",
      "691\n",
      "693\n",
      "695\n",
      "697\n",
      "700\n",
      "703\n",
      "705\n",
      "707\n",
      "708\n",
      "709\n",
      "710\n",
      "711\n",
      "712\n",
      "714\n",
      "715\n",
      "716\n",
      "717\n",
      "719\n",
      "720\n",
      "724\n",
      "725\n",
      "726\n",
      "727\n",
      "728\n",
      "729\n",
      "730\n",
      "731\n",
      "732\n",
      "733\n",
      "734\n",
      "735\n",
      "736\n",
      "738\n",
      "740\n",
      "748\n",
      "749\n",
      "750\n",
      "751\n",
      "752\n",
      "753\n",
      "754\n",
      "756\n",
      "758\n",
      "760\n",
      "762\n",
      "766\n",
      "767\n",
      "768\n",
      "769\n",
      "771\n",
      "772\n",
      "773\n",
      "774\n",
      "775\n",
      "776\n",
      "777\n",
      "779\n",
      "781\n",
      "782\n",
      "783\n",
      "784\n",
      "785\n",
      "786\n",
      "787\n",
      "788\n",
      "789\n",
      "790\n",
      "796\n",
      "797\n",
      "798\n",
      "799\n",
      "800\n",
      "801\n",
      "803\n",
      "804\n",
      "806\n",
      "807\n",
      "808\n",
      "809\n",
      "810\n",
      "812\n",
      "813\n",
      "815\n",
      "816\n",
      "818\n",
      "819\n",
      "821\n",
      "822\n",
      "824\n",
      "825\n",
      "826\n",
      "827\n",
      "829\n",
      "832\n",
      "833\n",
      "835\n",
      "837\n",
      "838\n",
      "840\n",
      "841\n",
      "842\n",
      "843\n",
      "844\n",
      "845\n",
      "846\n",
      "848\n",
      "850\n",
      "851\n",
      "852\n",
      "853\n",
      "854\n",
      "855\n",
      "856\n",
      "858\n",
      "859\n"
     ]
    }
   ],
   "source": [
    "cy_1 = \"CALL gds.alpha.betweenness.stream({nodeQuery: 'MATCH (a:Article) WHERE a.id = 1 WITH a.id as ids \"\n",
    "cy_2 = \"MATCH (e:Entity)-[r:OCCURS_WITH]-() WHERE r.article IN ids RETURN id(e) AS id',relationshipQuery: \"\n",
    "cy_3 = \"'MATCH (a:Article) WHERE a.id = 1 WITH a.id as ids MATCH (e:Entity)-[r:OCCURS_WITH]-(b:Entity) \"\n",
    "cy_4 = \"WHERE r.article IN ids RETURN id(e) AS source, id(b) AS target'}) YIELD nodeId, centrality WITH \"\n",
    "cy_5 = \"gds.util.asNode(nodeId).name AS user, centrality MATCH (e:Entity)-[r:OCCURS_IN]->(a:Article) WHERE e.name = user \"\n",
    "cy_6 = \"AND a.id = 1 AND centrality > 0 SET r.centrality = centrality\"\n",
    "old_id = \"1\"\n",
    "for i in range(len(data)):\n",
    "    cy_1 = cy_1.replace(old_id, str(data[\"id\"][i]))\n",
    "    cy_3 = cy_3.replace(old_id, str(data[\"id\"][i]))\n",
    "    cy_6 = cy_6.replace(old_id, str(data[\"id\"][i]))\n",
    "    old_id = str(data[\"id\"][i])\n",
    "    if g.evaluate(\"MATCH p=()-[r:OCCURS_WITH]->() WHERE r.article = $id RETURN count(p)\", parameters={\"id\": int(data[\"id\"][i])})>0:\n",
    "        print(old_id)\n",
    "        g.run(cy_1+cy_2+cy_3+cy_4+cy_5+cy_6)\n"
   ],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "name": "#%%\n"
    }
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}